{
    "favorites": [
        {
            "title": "Seventeen Seventy-six",
            "authors": ["David McCullough"],
            "description": "Draws on personal correspondence and period diaries to present a history of the American Revolution that includes the siege of Boston, the American defeat at Brooklyn, the retreat across New Jersey, and the American victory at Trenton.",
            "imageLinks": "http://books.google.com/books/content?id=R1Jk-A4R5AYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "bookID": "R1Jk-A4R5AYC",
            "id": 1
        }
    ],
    "library": [
        {
            "title": "Truman",
            "authors": ["David McCullough"],
            "description": "The Pulitzer Prize–winning biography of Harry S. Truman, whose presidency included momentous events from the atomic bombing of Japan to the outbreak of the Cold War and the Korean War, told by America’s beloved and distinguished historian. The life of Harry S. Truman is one of the greatest of American stories, filled with vivid characters—Roosevelt, Churchill, Stalin, Eleanor Roosevelt, Bess Wallace Truman, George Marshall, Joe McCarthy, and Dean Acheson—and dramatic events. In this riveting biography, acclaimed historian David McCullough not only captures the man—a more complex, informed, and determined man than ever before imagined—but also the turbulent times in which he rose, boldly, to meet unprecedented challenges. The last president to serve as a living link between the nineteenth and the twentieth centuries, Truman’s story spans the raw world of the Missouri frontier, World War I, the powerful Pendergast machine of Kansas City, the legendary Whistle-Stop Campaign of 1948, and the decisions to drop the atomic bomb, confront Stalin at Potsdam, send troops to Korea, and fire General MacArthur. Drawing on newly discovered archival material and extensive interviews with Truman’s own family, friends, and Washington colleagues, McCullough tells the deeply moving story of the seemingly ordinary “man from Missouri” who was perhaps the most courageous president in our history.",
            "imageLinks": "http://books.google.com/books/content?id=8fp1A2s6aQwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "bookID": "8fp1A2s6aQwC",
            "id": 1
        },
        {
            "title": "Alexander Hamilton",
            "authors": ["Ron Chernow"],
            "description": "The #1 New York Times bestseller, and the inspiration for the hit Broadway musical Hamilton! Pulitzer Prize-winning author Ron Chernow presents a landmark biography of Alexander Hamilton, the Founding Father who galvanized, inspired, scandalized, and shaped the newborn nation. \"Grand-scale biography at its best—thorough, insightful, consistently fair, and superbly written...A genuinely great book.\" —David McCullough “A robust full-length portrait, in my view the best ever written, of the most brilliant, charismatic and dangerous founder of them all.\" - Joseph Ellis Few figures in American history have been more hotly debated or more grossly misunderstood than Alexander Hamilton. Chernow’s biography gives Hamilton his due and sets the record straight, deftly illustrating that the political and economic greatness of today’s America is the result of Hamilton’s countless sacrifices to champion ideas that were often wildly disputed during his time. “To repudiate his legacy,” Chernow writes, “is, in many ways, to repudiate the modern world.” Chernow here recounts Hamilton’s turbulent life: an illegitimate, largely self-taught orphan from the Caribbean, he came out of nowhere to take America by storm, rising to become George Washington’s aide-de-camp in the Continental Army, coauthoring The Federalist Papers, founding the Bank of New York, leading the Federalist Party, and becoming the first Treasury Secretary of the United States.Historians have long told the story of America’s birth as the triumph of Jefferson’s democratic ideals over the aristocratic intentions of Hamilton. Chernow presents an entirely different man, whose legendary ambitions were motivated not merely by self-interest but by passionate patriotism and a stubborn will to build the foundations of American prosperity and power. His is a Hamilton far more human than we’ve encountered before—from his shame about his birth to his fiery aspirations, from his intimate relationships with childhood friends to his titanic feuds with Jefferson, Madison, Adams, Monroe, and Burr, and from his highly public affair with Maria Reynolds to his loving marriage to his loyal wife Eliza. And never before has there been a more vivid account of Hamilton’s famous and mysterious death in a duel with Aaron Burr in July of 1804. Chernow’s biography is not just a portrait of Hamilton, but the story of America’s birth seen through its most central figure. At a critical time to look back to our roots, Alexander Hamilton will remind readers of the purpose of our institutions and our heritage as Americans.",
            "imageLinks": "http://books.google.com/books/content?id=4z5eL5SGjEoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "bookID": "4z5eL5SGjEoC",
            "id": 2
        }
    ]
}
